; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v7 ?v3)
             (pred_6 ?v9 ?v13)
             (pred_1 ?v7 ?v13)
             (pred_3 ?v10 ?v7 )
	     (pred_5 ?v7)
             (pred_2 ?v8)
             (pred_9 ?v9)
             (pred_4 ?v13)
             (pred_7 ?v7)
             (pred_10 ?v9)
             (pred_11 ?v7)
             (pred_12 ))



(:action op_2
:parameters (?v11 ?v12 ?v6 ?v2)
:precondition (and (pred_2 ?v11) (pred_2 ?v12) (pred_9 ?v6) (pred_4 ?v2)
          (pred_8 ?v11 ?v12) (pred_6 ?v6 ?v2)
                   (pred_1 ?v12 ?v2) (pred_5 ?v11) 
                   (pred_7 ?v12) (pred_10 ?v6))
:effect (and  (pred_11 ?v12) (not (pred_7 ?v12))))


(:action op_1
:parameters (?v11 ?v4)
:precondition (and (pred_2 ?v11) (pred_2 ?v4)
               (pred_5 ?v11) (pred_8 ?v11 ?v4) (pred_11 ?v4))
:effect (and (pred_5 ?v4) (not (pred_5 ?v11))))

(:action op_5
:parameters (?v11 ?v6)
:precondition (and (pred_2 ?v11) (pred_9 ?v6) 
                  (pred_5 ?v11) (pred_3 ?v6 ?v11) (pred_12 ))
:effect (and (pred_10 ?v6)
   (not (pred_3 ?v6 ?v11)) (not (pred_12 ))))


(:action op_4
:parameters (?v11 ?v5 ?v1)
:precondition (and (pred_2 ?v11) (pred_9 ?v5) (pred_9 ?v1)
                  (pred_5 ?v11) (pred_10 ?v1) (pred_3 ?v5 ?v11))
:effect (and (pred_10 ?v5) (pred_3 ?v1 ?v11)
        (not (pred_10 ?v1)) (not (pred_3 ?v5 ?v11))))

(:action op_3
:parameters (?v11 ?v6)
:precondition (and (pred_2 ?v11) (pred_9 ?v6) 
                  (pred_5 ?v11) (pred_10 ?v6))
:effect (and (pred_12 ) (pred_3 ?v6 ?v11) (not (pred_10 ?v6)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_15 obj_04 obj_18 obj_13 obj_07 obj_11 obj_02 obj_14 obj_09 obj_22 obj_12 obj_17 obj_01 obj_19 obj_21
    obj_06 obj_16 obj_05
    obj_10 obj_03 obj_20
    )

    (:init
       (pred_12)

       (pred_2 obj_08)
       (pred_2 obj_15)
       (pred_2 obj_04)
       (pred_2 obj_18)
       (pred_2 obj_13)
       (pred_2 obj_07)
       (pred_2 obj_11)
       (pred_2 obj_02)
       (pred_2 obj_14)
       (pred_2 obj_09)
       (pred_2 obj_22)
       (pred_2 obj_12)
       (pred_2 obj_17)
       (pred_2 obj_01)
       (pred_2 obj_19)
       (pred_2 obj_21)
       (pred_4 obj_06)
       (pred_4 obj_16)
       (pred_4 obj_05)
       (pred_9 obj_10)
       (pred_9 obj_03)
       (pred_9 obj_20)

       (pred_8 obj_08 obj_13)
       (pred_8 obj_08 obj_15)
       (pred_8 obj_15 obj_07)
       (pred_8 obj_15 obj_04)
       (pred_8 obj_15 obj_08)
       (pred_8 obj_04 obj_11)
       (pred_8 obj_04 obj_18)
       (pred_8 obj_04 obj_15)
       (pred_8 obj_18 obj_02)
       (pred_8 obj_18 obj_04)
       (pred_8 obj_13 obj_14)
       (pred_8 obj_13 obj_07)
       (pred_8 obj_13 obj_08)
       (pred_8 obj_07 obj_09)
       (pred_8 obj_07 obj_11)
       (pred_8 obj_07 obj_15)
       (pred_8 obj_07 obj_13)
       (pred_8 obj_11 obj_22)
       (pred_8 obj_11 obj_02)
       (pred_8 obj_11 obj_04)
       (pred_8 obj_11 obj_07)
       (pred_8 obj_02 obj_12)
       (pred_8 obj_02 obj_18)
       (pred_8 obj_02 obj_11)
       (pred_8 obj_14 obj_17)
       (pred_8 obj_14 obj_09)
       (pred_8 obj_14 obj_13)
       (pred_8 obj_09 obj_01)
       (pred_8 obj_09 obj_22)
       (pred_8 obj_09 obj_07)
       (pred_8 obj_09 obj_14)
       (pred_8 obj_22 obj_19)
       (pred_8 obj_22 obj_12)
       (pred_8 obj_22 obj_11)
       (pred_8 obj_22 obj_09)
       (pred_8 obj_12 obj_21)
       (pred_8 obj_12 obj_02)
       (pred_8 obj_12 obj_22)
       (pred_8 obj_17 obj_01)
       (pred_8 obj_17 obj_14)
       (pred_8 obj_01 obj_19)
       (pred_8 obj_01 obj_09)
       (pred_8 obj_01 obj_17)
       (pred_8 obj_19 obj_21)
       (pred_8 obj_19 obj_22)
       (pred_8 obj_19 obj_01)
       (pred_8 obj_21 obj_12)
       (pred_8 obj_21 obj_19)
       (pred_7 obj_17)
       (pred_7 obj_15)
       (pred_7 obj_12)
       (pred_1  obj_17 obj_06)
       (pred_1  obj_15 obj_16)
       (pred_1  obj_12 obj_05)
       (pred_11 obj_08)
       (pred_11 obj_04)
       (pred_11 obj_18)
       (pred_11 obj_13)
       (pred_11 obj_07)
       (pred_11 obj_11)
       (pred_11 obj_02)
       (pred_11 obj_14)
       (pred_11 obj_09)
       (pred_11 obj_22)
       (pred_11 obj_01)
       (pred_11 obj_19)
       (pred_11 obj_21)

       (pred_6  obj_10 obj_06)
       (pred_6  obj_03 obj_16)
       (pred_6  obj_20 obj_05)
       (pred_3 obj_10 obj_11)
       (pred_3 obj_03 obj_11)
       (pred_3 obj_20 obj_13)
       (pred_5 obj_08)
    )

    (:goal (and
       (pred_3 obj_10 obj_14)
       (pred_3 obj_03 obj_02)
    ))
(:constraints
  (always (not (pred_5 obj_07)))
)
)

; plan
1. (op_1 obj_08 obj_13)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_13)
   goals met: 0 of 2
2. (op_5 obj_13 obj_20)
   deleted: (pred_3 obj_20 obj_13) (pred_12)
   added: (pred_10 obj_20)
   goals met: 0 of 2
3. (op_1 obj_13 obj_14)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_14)
   goals met: 0 of 2
4. (op_3 obj_14 obj_20)
   deleted: (pred_10 obj_20)
   added: (pred_12) (pred_3 obj_20 obj_14)
   goals met: 0 of 2
5. (op_1 obj_14 obj_09)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_09)
   goals met: 0 of 2
6. (op_1 obj_09 obj_22)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_22)
   goals met: 0 of 2
7. (op_1 obj_22 obj_11)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_11)
   goals met: 0 of 2
8. (op_5 obj_11 obj_03)
   deleted: (pred_3 obj_03 obj_11) (pred_12)
   added: (pred_10 obj_03)
   goals met: 0 of 2
9. (op_1 obj_11 obj_02)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_02)
   goals met: 0 of 2
10. (op_3 obj_02 obj_03)
   deleted: (pred_10 obj_03)
   added: (pred_12) (pred_3 obj_03 obj_02)
   goals met: 1 of 2
11. (op_1 obj_02 obj_11)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_11)
   goals met: 1 of 2
12. (op_5 obj_11 obj_10)
   deleted: (pred_3 obj_10 obj_11) (pred_12)
   added: (pred_10 obj_10)
   goals met: 1 of 2
13. (op_1 obj_11 obj_22)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_22)
   goals met: 1 of 2
14. (op_1 obj_22 obj_09)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_09)
   goals met: 1 of 2
15. (op_1 obj_09 obj_14)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_14)
   goals met: 1 of 2
16. (op_4 obj_14 obj_20 obj_10)
   deleted: (pred_10 obj_10) (pred_3 obj_20 obj_14)
   added: (pred_10 obj_20) (pred_3 obj_10 obj_14)
   goals met: 2 of 2
